## Importar pandas

In [3]:
import pandas as pd

## Ler DataFrame de arquivo CSV

In [4]:
data = pd.read_csv('titanic/train.csv') # Comma Separated Values - Valores Separados Por Vírgula

## Primeiras Linhas

In [5]:
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

## Últimas Linhas

In [6]:
data.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

## Informações do DataFrame

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Resumo Estatístico de Campos Numéricos

In [8]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Resumo estatístico de campos Categóricos

In [9]:
data.describe(include='O')

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

## Renomear colunas

In [10]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
data.rename({'Name': 'Nome', 'Sex': 'Sexo'}, axis=1, inplace=True)

In [12]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Nome', 'Sexo', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [13]:
data.columns = ['IdPassageiro', 'Sobreviveu', 'Classe', 'Nome', 'Sexo', 'Idade', 
                'IrmaosConjuge','PaisFilhos', 'Bilhete', 'Tarifa', 'Cabine', 'Embarque']

In [14]:
data.head(2)

,IdPassageiro,Sobreviveu,Classe,Nome,Sexo,Idade,IrmaosConjuge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [15]:
data.columns

Index(['IdPassageiro', 'Sobreviveu', 'Classe', 'Nome', 'Sexo', 'Idade',
       'IrmaosConjuge', 'PaisFilhos', 'Bilhete', 'Tarifa', 'Cabine',
       'Embarque'],
      dtype='object')

# Selecionar Colunas Específicas

In [16]:
data[['Nome','Sexo','Classe','Tarifa','Idade','Sobreviveu']].head()

,Nome,Sexo,Classe,Tarifa,Idade,Sobreviveu
0,"Braund, Mr. Owen Harris",male,3,7.2500,22.0,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,71.2833,38.0,1
2,"Heikkinen, Miss. Laina",female,3,7.9250,26.0,1
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,53.1000,35.0,1
4,"Allen, Mr. William Henry",male,3,8.0500,35.0,0

## Selecionando apenas uma coluna - Data Series

In [20]:
data['Sexo'] #dataserie é apenas a coluna do nosso dataframe, e ele so pode executar apena um elemento por vez.
data[['Sexo','Nome']] #dataframe pode ser varios elementos

       Sexo                                               Nome
0      male                            Braund, Mr. Owen Harris
1    female  Cumings, Mrs. John Bradley (Florence Briggs Th...
2    female                             Heikkinen, Miss. Laina
3    female       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4      male                           Allen, Mr. William Henry
..      ...                                                ...
886    male                              Montvila, Rev. Juozas
887  female                       Graham, Miss. Margaret Edith
888  female           Johnston, Miss. Catherine Helen "Carrie"
889    male                              Behr, Mr. Karl Howell
890    male                                Dooley, Mr. Patrick

[891 rows x 2 columns]

## Funções matemáticas embutidas

In [23]:
data['Idade'].mean() #media soma de todos os valores divida pela quantidade de valores

29.69911764705882

In [24]:
data['Idade'].sum() #soma

21205.17

In [25]:
data['Idade'].count() #contagem

714

In [26]:
data['Idade'].median() #mediana valor que divide no meio

28.0

In [28]:
data['Idade'].mode() #moda valor que mais se repete

0    24.0
dtype: float64

In [29]:
data['Idade'].max() #maior valor

80.0

In [32]:
data['Idade'].min() * 12  #menor valor

5.04

In [33]:
data['Idade'].idxmin() #indice do menor valor

803

In [ ]:
data['Idade'].idxmax() #indice do maior valor

In [36]:
data.mean() #media de todas as colunas

C:\Users\Lucas\AppData\Local\Temp/ipykernel_10228/651695864.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.mean() #media de todas as colunas

IdPassageiro     446.000000
Sobreviveu         0.383838
Classe             2.308642
Idade             29.699118
IrmaosConjuge      0.523008
PaisFilhos         0.381594
Tarifa            32.204208
dtype: float64

In [38]:
data.sum() #soma de todas as colunas

C:\Users\Lucas\AppData\Local\Temp/ipykernel_10228/2222140364.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.sum() #soma de todas as colunas

IdPassageiro                                                397386
Sobreviveu                                                     342
Classe                                                        2057
Nome             Braund, Mr. Owen HarrisCumings, Mrs. John Brad...
Sexo             malefemalefemalefemalemalemalemalemalefemalefe...
Idade                                                     21205.17
IrmaosConjuge                                                  466
PaisFilhos                                                     340
Bilhete          A/5 21171PC 17599STON/O2. 31012821138033734503...
Tarifa                                                  28693.9493
dtype: object

In [39]:
data.median() #mediana de todas as colunas

C:\Users\Lucas\AppData\Local\Temp/ipykernel_10228/2873654424.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.median() #mediana de todas as colunas

IdPassageiro     446.0000
Sobreviveu         0.0000
Classe             3.0000
Idade             28.0000
IrmaosConjuge      0.0000
PaisFilhos         0.0000
Tarifa            14.4542
dtype: float64

In [40]:
data.min() #menor valor de todas as colunas

C:\Users\Lucas\AppData\Local\Temp/ipykernel_10228/927168777.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.min()

IdPassageiro                       1
Sobreviveu                         0
Classe                             1
Nome             Abbing, Mr. Anthony
Sexo                          female
Idade                           0.42
IrmaosConjuge                      0
PaisFilhos                         0
Bilhete                       110152
Tarifa                           0.0
dtype: object

## Selecionando pelo Index - iloc

## Operador de seleção "loc"

## Selecionando com múltiplas condições

## map e replace

## Groupby - Agrupar por

## Crosstab

## Ordenando Dados

## Lidando com dados faltando $\rightarrow$ NaN - Not a Number

## Deletando Coluna ou Linha

## Apply e Lambda

## Variáveis Dummy | HotEncoder

## Concatenando DataFrames

# Expressões Regulares

.  - qualquer caracter
<br>\d - dígitos (0-9)
<br>\D - exceto dígitos (0-9)
<br>\w - palavra (a-z, A-Z, 0-9, \_)
<br>\s - espaço em branco (tab, espaço, nova linha)
<br>\S - qualquer coisa exceto espaço em branco (tab, espaço, nova linha)
<br>\b - início de uma palavra
<br>\B - exceto início da palavra
<br>^ - inicio de uma String
<br>$ - final de uma string
<br>[] - caracteres em colchetes
<br>[^] - caracteres não em colchetes
<br>| - ou
<br>( ) - grupo

<br>* - nenhum ou mais
<br>+ - um ou mais
<br>? - nenhum ou um
<br>{3} - número exato
<br>{3,4} - range de Números (mínimo, máximo)

Referência (inglês): 
http://bit.ly/ExpressoesRegulares

# Engenharia de Recursos - Feature Engineering

## Mudando Valores Linha Por Linha - iterrows()